# -*- mode:org; mode: flyspell; -*-

#+SETUPFILE: p-common.org

#+TITLE: Discrete mathematics I. practice - Logic and sets
#+SHORT_TITLE: Logic and sets

1. Considering the set of positive integers, let $P(x)$, $E(x)$,
   $O(x)$, and $D(x, y)$ mean that $x$ is prime, even, odd, and that
   $x$ is divisor of $y$.  Translate the following formulas into
   English.  Determine if they are true.  Negate them formally.
   Negate them in English.  Determine if the negation is true.
   1) $P(7)$; 
   2) $(E(2) \land P(2))$; 
   3) $(\forall x(D(2, x) \Rightarrow E(x)))$; 
   4) $(\exists x(E(x) \land D(x, 6)))$;  
   5) $(\forall x(\neg E(x) \Rightarrow \neg D(2, x)))$; 
   6) $(\forall x(E(x) \Rightarrow (\forall y(D(x, y) \Rightarrow
      E(y)))))$;  
   7) $(\forall x (P(x) \Rightarrow (\exists y (E(y) \land D(x,
      y)))))$; 
   8) $(\forall x(O(x) \Rightarrow (\forall y(P(y) \Rightarrow \neg
      D(x, y)))))$;  
   9) $((\exists x(E(x) \land P(x))) \land (\neg (\exists x(E(x)
      \land P (x) \land (\exists y(\neg x = y \land E(y) \land P
      (y)))))))$. 

2. Let $S()$, $R()$, $F()$, and $C()$ denote the statements that the
   sun is shining today, it is raining today, it is snowing today, and
   that yesterday it was cloudy. SRFC Translate into English (the
   empty parenthesis are omitted):
   1) $(S \Rightarrow \neg(R \land F))$; 
   2) $(C \Longleftrightarrow S )$; 
   3) $(C \land (S \vee R))$; 
   4) $(S \Longleftrightarrow ((R \land \neg F) \vee C))$;  
   5) $((S \Longleftrightarrow R) \land (\neg F \vee C))$; 

3. Considering the set of all the people in the world, let $L(x)$,
   $J(x)$, $S(x)$, $O(x)$, $E(x)$, $P(x)$, $R(x)$, $F(x)$, $M(x, y)$,
   and $R(x, y)$ mean that $x$ is a lawyer, judge, smarty pants, old,
   energetic, politician, representative, female, and that $x$ and $y$
   are married, and $x$ respects $y$. Formalise the following
   statements:
   1. every judge is a lawyer;
   2. there are smarty pants lawyers;
* Solutions
  1. Here are the formalizations a few:
     - $(E(2)\land P(2))$: Two is an even prime.
     - $(\exists x ( E(x) \Rightarrow D(x,6)))$: Six has an even
       divisor.
     - $(\forall x (P(x) \Rightarrow (\exists y (E(y) \land D(x,
       y)))))$: Every prime divides at least one even numbers.  And
       the formal negation: $(\exists x (P(x) \land (\forall y (\lnot
       E(x) \lor \lnot D(x,y)))))$. To get this there you need the
       DeMorgan identities: 
       1) $(\lnot (\forall x P(x))) \iff (\exists x (\lnot P(x)))$,
       2) $(\lnot (\exists x P(x))) \iff (\forall x (\lnot P(x)))$,
       3) $\lnot (\mathcal{A} \land \mathcal{B}) \iff (\lnot \mathcal{A}
          \lor \lnot \mathcal{B})$,
       4) $\lnot (\mathcal{A} \lor \mathcal{B}) \iff (\lnot \mathcal{A}
          \land \lnot \mathcal{B})$,
       and the transformation of implication into a disjunction:
       $(\mathcal{A} \Rightarrow \mathcal{B}) \iff (\lnot \mathcal{A}
       \lor \mathcal{B})$.  - The last one: There is only one even
       prime.
       
     - Here are a few negations.  The rules needed:
       \begin{align*}
       \lnot (\forall x P(x)) &\iff \exists x (\lnot P(x) )\\
       \lnot (\exists x P(x)) &\iff \forall x (\lnot P(x) )\\
       \lnot (A \land B) &\iff (\lnot A) \lor (\lnot B)\\
       \lnot (A \lor B) &\iff (\lnot A) \land (\lnot B)
       \end{align*}
       And the trick with the implication
       \[ A \Rightarrow B \iff \lnot A \lor B \] 
  
       So the answers for (d):
       \begin{align*}
       \lnot (\exists x (E(x) \land D(x,6))) &\iff 
       \forall x \lnot (E(x) \land D(x,6) ) \\ &\iff
       \forall x ( \lnot E(x) \lor \lnot D(x,6) )
       \end{align*}
  
       The answers for (e) (you have to use $\lnot \lnot A \iff
       A$):
       \begin{multline*}
       \lnot (\forall x (\lnot E(x) \Rightarrow \lnot D(2,x))) \iff\\
       \exists x \lnot (\lnot E(x) \Rightarrow \lnot D(2,x)) \iff\\ 
       \exists x \lnot (\lnot \lnot E(x) \lor \lnot D(2,x)) \iff\\
       \exists x \lnot (E(x) \lor \lnot D(2,x)) \iff\\
       \exists x (\lnot E(x) \land D(2,x)) 
       \end{multline*}
       
       The answer for (f):
       \begin{multline*}
       \lnot (\forall x (E(x) \Rightarrow (\forall y (D(x,y)\Rightarrow E(y))))) \iff\\
       \exists x (\lnot(E(x) \Rightarrow (\forall y (D(x,y)\Rightarrow E(y))))) \iff\\
       \exists x (\lnot(\lnot E(x) \lor (\forall y (D(x,y)\Rightarrow E(y))))) \iff\\
       \exists x (E(x) \land \lnot (\forall y (D(x,y)\Rightarrow E(y)))) \iff\\
       \exists x (E(x) \land \exists y (\lnot(D(x,y)\Rightarrow E(y)))) \iff\\
       \exists x (E(x) \land \exists y (\lnot(\lnot D(x,y)\lor E(y)))) \iff\\
       \exists x (E(x) \land \exists y (D(x,y)\land \lnot E(y)))
       \end{multline*}
       

  2. HW.
  3. Some solutions:
     - Every judge is a lawyer. $\forall x (J(x) \Rightarrow L(x))$.
     - Except the judges, all lawyers are smarty pants. $\forall x
       (L(x) \land \lnot J(x)) \Rightarrow S(x)$.
     - Only judges respect judges. $\forall x (\forall y ( (R(x,y)
       \land J(y)) \Rightarrow J(x)))$.
     - Every judge respects only judges. $\forall x (\forall y (
       (R(x,y) \land J(y)) \Rightarrow J(y)))$.
     - The lawyers with energetic wives are all representatives.
       $\forall x ( (L(x)\land ( \exists y (F(y) \land M(x,y) \land
       E(y)) ) \Rightarrow R(x)))$.
  4. Some examples:
     - $Father(x,y) := \lnot F(x) \land C(y,x)$.
     - $Uncle(x,y) := \lnot F(x) \land (\exists g (\exists p ( C(y,p)
       \land C(p,g) \land C(x,g) \land \lnot p = x)))$. Here $x$ is
       the uncle, $y$ is the nephew, $g$ is the uncles parent (nephews
       grandparent), $p$ is the nephews parent.  This definition
       includes ``half uncles''.
  5. HW
  6. HW
  7. HW
  8. Hard! HW
  9. Hard! HW
  10. $A \cap B \neq \emptyset$, so $\exists x \in A \cap B$, so $A
      \cap C = \emptyset$ implies that $x\not\in A \cap C$, so
      $x\not\in C$, but then $x \in (A\cap B)\setminus C$ \ie $(A \cap
      B) \setminus C = \emptyset$ can not be true.  We have proven
      that there is no solution, \ie there are no such sets which
      satisfy these properties.
  11. HW***
  12. $\mathcal{A}=\{ \{a,b\}, \{b,c\}, \{c,a\}\}$ is disjoint but not
      pairwise disjoint.  Generally, pairwise disjoint sets are
      disjoint, (with the exception of the special case of a single
      non-empty set: \ie $\mathcal{B}=\{\{x\}\}$ is pairwise disjoint,
      but not disjoint).
  13. $\cup\mathcal{A}=\{a,b,c,d,e,f\}$, $\cap\mathcal{A} = \{a\}$.
  14. Let's solve this with a small python program.
      #+BEGIN_SRC python :results output :exports both
        x = ["apple", "plumb"]
        y = ["cat", "dog" ]
        empty = []

        def subset(A,B):
            for a in A:
                if not a in B: return False
            return True

        def intersect(A,B):
            r = []
            for a in A:
                if a in B: r.append(a)
            return r

        def setminus(A,B):
            r = []
            for a in A:
                if not a in B: r.append(a)
            return r

        def union(A,B):
            r = []
            for x in A:
                if not x in r: r.append(x)
            for x in B:
                if not x in r: r.append(x)
            return r
            
        testcases = [
            [[x],y],
            x,
            intersect([empty],x),
            setminus([x],[[x]]),
            union([x],x),
            union([x],[empty])
        ]
        print("The set                                 x in, x subset")
        for t in testcases:
            print( "{:<38}, {:<5}, {:<5}"
                .format(str(t), str(x in t), str(subset(x,t))))
        
      #+END_SRC

      #+RESULTS:
      : [[['apple', 'plumb']], ['cat', 'dog']], False, False
      : ['apple', 'plumb']                    , False, True 
      : []                                    , False, False
      : [['apple', 'plumb']]                  , True , False
      : [['apple', 'plumb'], 'apple', 'plumb'], True , True 
      : [['apple', 'plumb'], []]              , True , False

